var select_item = 0;

var item_name = [
    "Накидка хранителя", "Лезвие антимагии", "Ржавый меч", "Колчан", "Стальные латы", "Шлем", "Сфера магии", "Сфера яда", "Камень душ", "Брошка", "Деревянный щит", "Волшебный огонь", "Священная книга", "Рубин", "Заживляющий бальзам", "Камень скорби", "Платок волшебства", "Деревянный лук",
    "Мантия хранителя", "Бутыль", "Топор войны", "Ядовитый кинжал", "Шипастый щит", "Холодное лезвие", "Перстень души", "Амулет вампира", "Маска вуду", "Латы доблести", "Волшебная мантия", "Барабан войны", "Плёнка призрака", "Драгоценное копьё", "Ботинок скорости", "Меч скорби", "Кровавый сгусток", "Прочный лук",
    "Роба целителя", "Магический посох", "Стальная кираса", "Амулет чар", "Плащ стужи", "Клинок мороза", "Абордажная сабля", "Рубиновый посох", "Потусторонний жезл", "Копьё мести", "Колье волшебницы", "Перстень зла", "Ботинок силы", "Капюшон убийцы", "Перчатки лучника", "Меч великой скорби", "Проклятый шеврон", "Укреплённый арбалет",
    "Фляга с лекарством", "Линза видений", "Волшебный камень", "Проклятый посох", "Жезл молний", "Медальон удачи", "Пылающая булава", "Маска трепета", "Роба волшебника", "Кольцо отречения", "Кольцо антимагии", "Ботинок регенерации", "Ботинок волшебства", "Шлем презрения", "Мантия защиты", "Сфера поглощения", "Роба ловкости", "Бич драконов",
    "Растворитель снов", "Клинок антимагии", "Ведьмино жало", "Священный талисман", "Медальон кровавого проклятия", "Скипетр света", "Лунное сияние", "Сжигающий меч", "Кровь божества", "Драконья чешуя", "Кольцо королевской власти", "Ботинок ярости", "Кинжал сакуры", "Маска зверя", "Оковы зверя", "Меч поглощения", "Накидка тёмных искусств", "Божественный лук",
    "Извлекатель эссенции", "Меч кровавого проклятия", "Сердце чародейства", "Сердце дракона", "Осквернённое желание", "Меч из кости дракона", "Плащ стража", "Щит поддержки", "Перстень Катрин", "Полуночная призма", "Когти демона", "Скороходы чемпиона", "Солнечный меч", "Зачарованное зеркало", "Туман в банке", "Клинок сущности", "Мантия демона", "Божественное правосудие",
    "Клинок проворства", "Диадема", "Волшебная палочка", "Сфера разрушения", "Меховая шапка", "Тотем вуду", "Катана", "Шипастая броня", "Волшебный перстень", "Колючий амулет", "Щит палладина", "Душа силы", "Око демона", "Призрачная брошка", "Душа величия", "Тяжёлая балиста", "Печать астролога", "Душа могущества"
];
var item_eng_name = [
    "mantle_of_intelligence.jpg", "falcon_blade.jpg", "claymore.jpg", "enchanted_quiver.jpg", "chainmail.jpg", "helm_of_iron_will.jpg", "linkens_sphere.jpg", "orb_of_venom.jpg", "bloodstone.jpg", "Faded_Broach_icon.png", "Stout_Shield_icon.png", "faerie_fire.jpg", "tome_of_knowledge.jpg", "Siltbreaker_Orb_of_Passage_icon.png", "healing_salve.jpg", "blight_stone.jpg", "infused_raindrops.jpg", "Grove_Bow_icon.webp",
    "robe_of_the_magi.jpg", "bottle.jpg", "ogre_axe.jpg", "Prince_Knife_icon.png", "Poor_Man_Shield_icon.png", "Trident_icon.png", "Ring_of_Tarrasque_icon.png", "Vampire_Fangs_icon.png", "voodoo_mask.jpg", "crimson_guard.jpg", "nether_shawl.jpg", "drum_of_endurance.jpg", "Siltbreaker_Sign_of_the_Arachnid_icon.png", "javelin.jpg", "boots_of_speed.jpg", "sange.jpg", "Havoc_Hammer_icon.webp", "Specialist_Array_icon.webp",
    "robe_of_the_magi.jpg", "kaya.jpg", "chipped_vest.jpg", "spell_prism.jpg", "eternal_shroud.jpg", "Siltbreaker_The_Caustic_Finale_icon.png", "echo_sabre.jpg", "Dagon_3_icon.png", "Siltbreaker_Oblivion_Locket_icon.png", "hurricane_pike.jpg", "null_talisman.jpg", "soul_ring.jpg", "power_treads.jpg", "cloak.jpg", "gloves_of_haste.jpg", "Penta-Edged_Sword_icon.png", "Dragon_Scale_icon.webp", "Ballista_icon.webp",
    "Elixir_1_icon.png", "gem_of_true_sight.jpg", "aether_lens.jpg","orchid_malevolence.jpg", "gleipnir.jpg", "talisman_of_evasion.jpg", "rod_of_atos.jpg", "vladmirs_offering.jpg", "veil_of_discord.jpg", "giants_ring.jpg", "arcane_ring.jpg", "tranquil_boots.jpg", "arcane_boots.jpg", "helm_of_the_dominator.jpg", "hood_of_defiance.jpg", "aeon_disk.jpg", "Elven_Tunic_icon.webp", "Siltbreaker_Ice_Dragon_Maw_icon.webp",
    "Third_Eye_icon.png", "diffusal_blade.jpg", "witch_blade.jpg", "solar_crest.jpg", "aegis_of_the_immortal.jpg", "Siltbreaker_Siltbreaker_Dredged_Trident_icon.png", "silver_edge.jpg", "radiance.jpg", "River_Vial_Blood_icon.png", "Siltbreaker_Gravel_Foot_icon.png", "psychic_headband.jpg", "Siltbreaker_Treads_of_Ermacor_icon.png", "Siltbreaker_Violet_Blade_icon.png", "wraith_pact.jpg", "witchbane.jpg", "demon_edge.jpg", "Fighting_the_Year_Beast_Vermillion_Robe_icon.webp", "Flicker_icon.webp",
    "apex.jpg", "bloodthorn.jpg", "stormcrafter.jpg", "heart_of_tarrasque.jpg", "ninja_gear.jpg", "abyssal_blade.jpg", "cloak_of_flames.jpg", "arcanists_armor.jpg", "essence_ring.jpg", "seer_stone.jpg", "Siltbreaker_Paw_of_Lucius_icon.png", "boots_of_travel_2.jpg", "paladin_sword.jpg", "mirror_shield.jpg", "smoke_of_deceit.jpg", "butterfly.jpg", "Siltbreaker_Unhallowed_Icon_icon.webp", "Siltbreaker_Wand_of_the_Brine_icon.webp",
    "blade_of_alacrity.jpg", "diadem.jpg", "magic_wand.jpg", "orb_of_corrosion.jpg", "fluffy_hat.jpg", "headdress.jpg", "yasha.jpg", "blade_mail.jpg", "ring_of_basilius.jpg", "nullifier.jpg", "pavise.jpg", "healing_lotus.jpg", "eye_of_skadi.jpg", "revenants_brooch.jpg", "great_healing_lotus.jpg", "daedalus.jpg", "phylactery.jpg", "greater_healing_lotus.jpg"
];

var item_bonus = [
    ["Здоровье", "Регенерация здоровья"], ["Мана", "Сопротивление магии"], ["Урон"], ["Шанс крита"], ["Защита"], ["Здоровье", "Защита"], ["Урон заклинаний"], [], ["Здоровье", "Регенерация здоровья", "Урон"], ["Регенерация маны"], [], [], ["Сопротивление эффектам"], ["Крит урон", "Шанс крита"], [], [], ["Регенерация маны", "Урон заклинаний"], ["Скорость атаки"],
    ["Здоровье", "Регенерация здоровья", "Мана", "Сопротивление магии"], [], ["Урон", "Шанс крита"], ["Урон"], [], ["Скорость атаки"], ["Здоровье", "Регенерация здоровья", "Урон", "Вампиризм"], ["Вампиризм"], ["Здоровье", "Регенерация маны", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], ["Здоровье", "Защита"], ["Здоровье", "Регенерация здоровья", "Регенерация маны", "Урон заклинаний"], ["Скорость", "Уворот"], ["Сопротивление магии", "Уворот"], ["Скорость атаки"], ["Скорость"],  ["Мана", "Урон", "Сопротивление магии"], ["Здоровье", "Защита", "Сопротивление магии"], ["Здоровье", "Урон", "Скорость атаки"],
    ["Здоровье", "Регенерация здоровья", "Мана", "Сопротивление магии", "Эффективность лечения"], ["Урон заклинаний", "Манакост способностей", "Перезарядка способностей"], ["Здоровье", "Защита", "Скорость"], ["Мана", "Сопротивление магии", "Урон заклинаний"], ["Здоровье", "Регенерация здоровья", "Регенерация маны", "Скорость атаки", "Урон заклинаний"], [], ["Урон"], ["Крит урон"], ["Сопротивление магии", "Уворот"], ["Урон", "Скорость атаки", "Шанс крита"], ["Регенерация маны"], ["Здоровье", "Регенерация здоровья", "Урон", "Вампиризм", "Эффективность лечения"], ["Здоровье", "Урон", "Скорость"], ["Скорость"], ["Скорость", "Урон по постройкам"], ["Мана", "Урон", "Сопротивление магии"], ["Здоровье", "Регенерация маны", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Урон заклинаний"], ["Здоровье", "Урон", "Скорость атаки"],
    ["Регенерация маны"], ["Дальность обзора (день)", "Дальность обзора (ночь)"], ["Урон заклинаний"], ["Урон заклинаний", "Манакост способностей", "Перезарядка способностей"], ["Мана", "Регенерация маны", "Сопротивление магии"], ["Мана", "Сопротивление магии", "Уворот", "Шанс крита", "Урон заклинаний"], ["Урон", "Крит урон", "Шанс крита"], ["Здоровье", "Регенерация маны", "Крит урон", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], ["Здоровье", "Регенерация здоровья", "Мана", "Регенерация маны", "Скорость атаки", "Сопротивление магии", "Урон заклинаний"], ["Урон", "Вампиризм"], ["Регенерация маны", "Сопротивление магии"], ["Регенерация здоровья", "Скорость"], ["Скорость"], ["Здоровье", "Защита", "Скорость"], ["Здоровье", "Регенерация здоровья", "Мана", "Защита", "Сопротивление магии", "Эффективность лечения"], ["Урон", "Защита", "Сопротивление магии", "Эффективность лечения", "Эффективность восстановления маны"], ["Скорость", "Уворот", "Урон по постройкам"], ["Здоровье", "Урон", "Скорость атаки", "Крит урон", "Шанс крита"],
    ["Урон заклинаний", "Дальность обзора (день)", "Дальность обзора (ночь)"], ["Мана", "Скорость атаки"], ["Крит урон", "Шанс крита", "Урон заклинаний", "Манакост способностей", "Перезарядка способностей"], ["Мана", "Защита", "Сопротивление магии", "Уворот", "Шанс крита", "Урон заклинаний"], ["Урон", "Вампиризм"], ["Здоровье", "Сопротивление магии", "Уворот"], ["Урон", "Скорость атаки", "Шанс крита"], ["Урон", "Крит урон", "Шанс крита"], ["Здоровье", "Регенерация здоровья"], ["Здоровье", "Урон", "Защита", "Скорость"], ["Скорость атаки", "Сопротивление эффектам", "Крит урон"], ["Здоровье", "Урон", "Скорость"], ["Скорость атаки"], ["Здоровье", "Регенерация маны", "Защита", "Скорость", "Крит урон", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], [], ["Мана", "Урон", "Защита", "Сопротивление магии", "Вампиризм", "Эффективность лечения", "Эффективность восстановления маны"], ["Здоровье", "Регенерация маны", "Защита", "Сопротивление эффектам", "Уворот", "Урон заклинаний", "Урон по постройкам"], ["Здоровье", "Урон", "Скорость атаки", "Крит урон", "Шанс крита"],
    ["Мана", "Регенерация маны", "Сопротивление магии", "Эффективность восстановления маны"], ["Урон", "Вампиризм"], ["Здоровье", "Регенерация здоровья", "Мана", "Регенерация маны", "Скорость атаки", "Сопротивление магии", "Урон заклинаний"], ["Здоровье", "Регенерация здоровья", "Урон", "Защита", "Скорость"], ["Мана", "Скорость атаки"], ["Здоровье", "Урон", "Защита", "Скорость", "Крит урон"], ["Здоровье", "Регенерация здоровья", "Мана", "Защита", "Сопротивление магии", "Эффективность лечения"], ["Регенерация здоровья", "Скорость", "Уворот"], ["Мана", "Скорость атаки", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Уворот", "Крит урон", "Шанс крита", "Урон заклинаний"], ["Крит урон", "Шанс крита", "Урон заклинаний", "Манакост способностей", "Перезарядка способностей", "Дальность обзора (день)", "Дальность обзора (ночь)"], ["Урон", "Скорость атаки", "Скорость", "Шанс крита", "Урон по постройкам"], ["Здоровье", "Регенерация здоровья", "Урон", "Скорость"], ["Здоровье", "Урон", "Сопротивление магии", "Уворот", "Крит урон", "Шанс крита"], ["Регенерация маны", "Урон", "Сопротивление магии", "Сопротивление эффектам", "Эффективность восстановления маны"], ["Здоровье", "Регенерация маны", "Защита", "Скорость", "Крит урон", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], ["Мана", "Урон", "Защита", "Сопротивление магии", "Вампиризм", "Эффективность лечения", "Эффективность восстановления маны"], ["Здоровье", "Регенерация маны", "Защита", "Сопротивление эффектам", "Уворот", "Урон заклинаний", "Вампиризм", "Урон по постройкам"], ["Здоровье", "Урон", "Скорость атаки", "Крит урон", "Шанс крита"],
    ["Регенерация здоровья", "Регенерация маны", "Скорость атаки", "Скорость"], ["Мана", "Защита", "Сопротивление магии"], ["Урон", "Урон заклинаний", "Магический вампиризм", "Манакост способностей", "Перезарядка способностей"], ["Защита", "Сопротивление магии", "Урон заклинаний"], ["Регенерация здоровья", "Скорость атаки", "Сопротивление эффектам"], ["Здоровье", "Регенерация здоровья", "Регенерация маны"], ["Урон", "Скорость атаки", "Защита", "Уворот", "Крит урон", "Шанс крита"], ["Регенерация здоровья", "Защита"], ["Урон заклинаний", "Магический вампиризм", "Манакост способностей", "Перезарядка способностей"], ["Регенерация здоровья", "Урон", "Вампиризм"], ["Урон", "Крит урон", "Шанс крита", "Эффективность лечения"], ["Здоровье", "Мана", "Урон", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Скорость", "Эффективность лечения", "Эффективность восстановления маны"], ["Урон", "Скорость атаки", "Скорость", "Уворот", "Крит урон", "Шанс крита"], ["Регенерация здоровья", "Мана", "Регенерация маны", "Сопротивление магии", "Сопротивление эффектам", "Уворот"], ["Здоровье", "Мана", "Урон", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Скорость", "Эффективность лечения", "Эффективность восстановления маны"], ["Урон", "Скорость атаки", "Скорость", "Крит урон"], ["Мана", "Сопротивление магии", "Сопротивление эффектам", "Урон заклинаний", "Манакост способностей", "Дальность обзора (день)", "Дальность обзора (ночь)"], ["Здоровье", "Мана", "Урон", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Скорость", "Эффективность лечения", "Эффективность восстановления маны"]
];
var item_bonus_num = [
    [45, 0.6], [20, 2], [7], [3], [5], [30, 3], [6], [], [-50, -1.5, 25], [0.9], [], [], [10], [30, -4], [], [], [1.4, -10], [12],
    [90, 1.5, 25, 3.5], [], [12, 4], [10], [], [-12], [-70, -1.1, 30, 5], [5], [-120, 1.1, 8, 8, 10], [100, 10], [50, 0.7, 1.5, 7], [12, 4], [-15, 12], [30], [35], [30, 14, 4], [300, -15, -10], [40, 10, 15],
    [180, 2.5, 40, 5, 10], [8, -10, -5], [275, 15, -20], [80, 13, 6], [60, 0.8, 3.2, -20, 8], [], [40], [40], [-20, 17], [25, 35, 6], [4.5], [-140, -0.8, 60, 10, -40], [60, 10, 40], [10], [15, 15], [50, 15, 8.5], [550, 2, -20, -10, 5, -7.5], [100, 15, 30],
    [1.2], [300, 180], [20], [12, -15, -7], [65, 1.5, 7], [100, 13, 5, 8, 8], [25, 35, 7], [-150, 1.8, 20, 10, 15, 15], [75, 1, 150, 8, -30, 15, 15], [70, 15], [-2, 25], [3, 50], [35], [80, 13, 15], [230, 2.6, 40, 12, 12, 17.5], [40, -15, 25, -15, -15], [30, 10, 12], [120, 25, 75, 20, -4],
    [25, 500, 300], [-90, 55], [50, 7, 15, -15, -8], [200, 8, 16, 8, 10, 8], [80, 25], [150, -15, 20], [40, 40, 12], [30, 45, 10], [750, 15], [350, -40, 32, -25], [40, 15, 35], [140, 25, 45], [115], [-50, 1.8, 13, 18, 25, 10, 15, 20], [], [100, 60, -15, 30, 10, -15, -15], [700, 3, -25, 20, 15, -10, 12], [150, 35, 90, 55, -8],
    [85, 3, 10, 20], [100, 30], [80, 1.5, 350, 9.5, -40, 20, 20], [1200, 25, -40, 40, -35], [-60, 180], [400, 30, 30, -20, 30], [600, 4.4, 60, 25, 14, 20], [4, 25, 6], [300, 50, 10, 20, 20, 10, 40, 15, 10], [50, 10, 40, -15, -10, 500, 300], [55, 45, 20, 15, 30], [180, 4, 30, 110], [160, 45, -15, 20, 60, 12], [-2.8, 15, 40, 15, -25], [-170, 2.9, 13, 30, 30, 12, 18, 25], [130, 65, -10, 35, 15, -15, -15], [800, 4, -25, 35, 15, -10, 10, 15], [200, 60, 130, 85, -10],
    [-1.5, -1.5, 60, 30], [50, -10, 15], [-8, 5, 5, -5, -5], [-15, -15, 40], [4, -35, 15], [80, 2, -0.8], [15, 75, -20, 10, -50, 15], [-0.5, 25], [45, 7.5, 20, 25], [-20, 50, 50], [-15, -20, -5, 15], [300, 150, 15, 10, 10, 10, 25, -15, -15], [30, 75, -25, -15, 90, 15], [3, -200, 2, -60, 40, 40], [600, 250, 25, 15, 15, 15, 30, -20, -20], [100, -100, -50, 100], [500, 20, -20, 30, -20, -300, -200], [1000, 400, 35, 20, 20, 20, 45, -25, -25]
];

var cost = [
    145, 115, 140, 165, 220, 180, 140, 120, 240, 245, 200, 185, 240, 275, 160, 135, 250, 225,
    250, 345, 270, 215, 450, 520, 415, 425, 375, 490, 250, 610, 465, 670, 550, 355, 440, 365,
    940, 1260, 875, 700, 900, 980, 1345, 900, 770, 745, 1200, 815, 800, 770, 710, 850, 600, 670,
    1120, 870, 1600, 1530, 1370, 1420, 2145, 2000, 1850, 2100, 1985, 1300, 1300, 1450, 1600, 1500, 1100, 1530,
    2750, 3380, 3600, 3000, 3120, 2670, 3300, 3700, 4000, 4250, 3600, 2970, 2680, 2670, 2500, 3200, 3050, 3325,
    4700, 5600, 6000, 5600, 4400, 5700, 5500, 4800, 5160, 4800, 5150, 5270, 4820, 5200, 5450, 5750, 5640, 5300,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
];
var components = [
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [],
    [0, 0, 1], [], [2, 3], [2, 7], [10], [], [8, 25], [], [6, 8, 9, 25], [4, 5], [0, 6, 9], [], [], [], [], [1, 2, 15], [], [2, 17],
    [0, 11, 18], [6], [27], [1, 6], [9, 23, 28], [7, 23], [2], [3, 13], [30], [20, 21, 31], [], [24], [32], [], [], [11, 33], [12, 16, 22, 34], [35],
    [14, 19], [], [6, 6, 6], [37], [1, 1, 9], [3, 3, 39], [13, 20], [26], [39, 40, 46], [47], [], [32], [32], [5, 49], [4, 36], [], [50], [31, 53],
    [55, 56], [31], [43, 57], [59], [63], [44], [41, 45], [60], [], [], [12, 13], [48], [31], [61, 67], [], [51, 69], [52, 70], [13, 71],
    [54, 58], [76], [62], [80, 81], [73, 84], [42, 81], [38, 68], [22, 29], [75, 82], [72, 74], [50, 78], [65, 66, 83], [77, 79], [64, 69], [85, 86], [87], [88], [89],
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []
];
var item_rarity = [ // 0-обычный  1-необычный  2-редкий  3-эпический  4-легендарный  5-божественный
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
    3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
    4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
    5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
    0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5
];

var item_skill_name = [ // Название способности
    [], [], [], [], [], [], [], ["Отравление"], [], [], ["Блок"], ["Неиссякаемое пламя"], [], [], ["Заживление"], ["Порча"], [], [],
    [], ["Восстановление"], [], ["Отравление"], ["Блок", "Шипы"], ["Стужа"], ["Разделение души"], ["Река крови"], ["Магия вуду"], [], [], ["Воодушевление"], [], [], [], ["Порча"], [], [],
    ["Секрет целителя"], [], [], [], ["Ледяная вьюга"], ["Оледенение"], ["Контратака"], ["Магическое разрушение"], ["Бестелесная форма"], ["Отравление"], [], ["Разделение души"], [], ["Удар исподтишка"], [], ["Разъедание брони", "Клинок погибели"], ["Проклятье порченой крови"], ["Обезоруживание"],
    ["Восстановление"], ["Всевиденье"], ["Магическая слабость"], ["Проклятие антимагии"], ["Электрошок"], [], [], ["Жертва"], ["Ледяной плащ"], ["Отречение"], ["Отражение заклинаний"], [], ["Аура волшебства"], ["Удар исподтишка"], ["Секрет целителя"], [], ["Расторопность"], ["Утяжелённые стрелы"],
    ["Всевиденье", "Растворение"], ["Антимагия", "Сжигание души"], ["Магическое разрушение", "Проклятие антимагии"], [], ["Проклятый медальон"], ["Священная форма"], ["Лезвие ночи", "Лунный свет"], ["Сжигание"], [], [], ["Королевский щит"], ["Ярость"], [], ["Жертва", "Удар исподтишка"], ["Связующие цепи"], ["Разъедание брони", "Погибель"], ["Ветер тьмы", "Искусство разрушения", "Тёмное отражение"], ["Божественные стрелы", "Божественное исцеление"],
    ["Разрушение сущности", "Восстановление"], ["Проклятый меч"], ["Чародейский щит"], [], ["Антимагия", "Осквернение"], ["Выпад дракона"], ["Регенерация"], ["Блок", "Возврат отправителю", "Воодушевление"], ["Королевский щит"], ["Всевиденье", "Волшебство призмы", "Магическое разрушение"], ["Хищник", "Ночной охотник"], ["Аура волшебства", "Ярость"], ["Священная форма", "Испепеление"], ["Отражение заклинаний"], ["Связующий туман", "Фантомный удар"], ["Разрушение защиты", "Погибель"], ["Ветер тьмы", "Искусство демона", "Тёмное отражение"], ["Божественные стрелы", "Вечный баланс"],
    [], [], [], ["Саморазрушение"], [], ["Преобразование"], [], ["Мученичество"], [], ["Амулет страданий"], ["Страж света"], ["Воля к жизни"], ["Демонический пакт"], ["Потустороння брошка"], ["Воля к жизни"], ["Оглушающий выстрел"], ["Астрология"], ["Воля к жизни"]
];
var item_info = [ // Описание способности
    [], [], [], [], [], [], [], ["С шансом 10% атака отравит цель"], [], [], ["С шансом 30% поглощает 12 ед. входящего урона"], ["Увеличивает регенерацию здоровья на 2.5 ед., если здоровье ниже 20%"], [], [], ["Мгновенно восстанавливает 40 ед. здоровья"], ["Снижает броню цели атаки на 10%"], [], [],
    [], ["Восстанавливает 15 ед. здоровья и 5 ед. маны в секунду.<br>Здоровье и мана восстанавливаются вдвое медленнее, если в последние 3 секунды герой получал урон"], [], ["С шансом 15% атака отравит цель"], ["С шансом 30% поглощает 25 ед. входящего урона", "Возвращает 10% входящего урона обратно в атакующего"], ["Атаки героя снижают скорость передвижения и атаки цели на 30 ед., а также наносят дополнительный периодический урон"], ["Жертвует 70 ед. здоровья, взамен получая 30 ед. дополнительного урона и 8% вампиризма. Применение способности не может убить владельца"], ["Увеличивает вампиризм на 8%, если у героя осталось меньше 15% здоровья"], ["Увеличивает физический и магический вампиризм на 5%, если у героя осталось меньше 15% здоровья"], [], [], ["Время от времени увеличивает скорость атаки героя и союзников в радиусе 500 ед. на 25 ед."], [], [], [], ["Снижает броню цели атаки на 10%"], [], [],
    ["Увеличивает регенерацию здоровья на 4 ед., если здоровье ниже 25%"], [], [], [], ["Снижает скорость передвижения на 30 ед., а скорость атаки на 25 ед. всех противников в небольшом радиусе вокруг героя. Противники в радиусе ауры получают периодический урон"], ["Атаки героя снижают скорость передвижения и атаки цели на 50 ед., а также наносят дополнительный периодический урон"], ["С шансом 10% атака противника увеличит скорость атаки героя на 30 ед."], ["Любой урон от заклинаний и предметов владельца может быть критическим. Шанс и размер крита зависят от тех же параметров у героя"], ["Герой уходит в мир духов, что позволяет не получать никакого физического урона. Под действием эффекта герой не может атаковать, но получает возможность проходить сквозь препятствия"], ["С шансом 30% атака отравит цель"], [], ["Жертвует 140 ед. здоровья, взамен получая 60 ед. дополнительного урона и 25% вампиризма. Применение способности не может убить владельца"], [], ["Раз в 4 секунды увеличивает урон следующей атаки на 70%"], [], ["Снижает броню цели атаки на 20%", "Атаки героя наносят на 10 ед. больше урона, если у цели менее 20% здоровья"], ["Каждая атака наносит дополнительные 1.5% магического урона от максимального здоровья владельца"], ["Каждая атака с шансом 10% обезоружит противника"],
    ["Восстанавливает 60 ед. здоровья в секунду.<br>Здоровье восстанавливается вдвое медленнее, если в последние 2 секунды герой получал урон"], ["Раскрывает невидимых юнитов поблизости"], ["Уменьшает магическое сопротивление всех противников вокруг на 25%"], ["Накладывает немоту на владельца и окружающих противников"], ["Каждая атака с шансом 35% ударит противника молнией, наносящей урон и сжигающей 35 ед. маны"], [], [], ["Накладывает немоту на владельца и забирает 25 ед. здоровья в секунду. Взамен герой получает 10% шанса крита и 50% крит урона. Урон маски не может убить владельца"], ["Снижает скорость передвижения на 30 ед., а скорость атаки на 40 ед. всех противников в небольшом радиусе вокруг героя. Противники в радиусе ауры получают периодический урон"], ["Даёт 70 ед. дополнительного урона, 40% крит урона и 10% шанса крита, но снижает эффективность лечения героя на 70%"], ["Поглощает любое направленное заклинание, целью которого стал герой"], [], ["Снижает сопротивление эффектам на 15% всех противников вокруг героя"], ["Раз в 3 секунды увеличивает урон следующей атаки на 70%"], ["Увеличивает регенерацию здоровья на 4 ед., если здоровье ниже 25%"], [], ["Увеличивает скорость передвижения на 80 ед., если владелец не получал урон в течении последних 5-ти секунд"], ["Каждая атака с шансом 15% обезоружит противника"],
    ["Раскрывает невидимых юнитов поблизости", "Уменьшает магическое сопротивление всех противников вокруг на 35%"], ["Снимает все негативные эффекты с владельца", "Каждая атака сжигает 20 ед. маны противника и наносит вдвое больше чистого урона от сожённой маны"], ["Любой урон от заклинаний и предметов владельца может быть критическим. Шанс и размер крита зависят от тех же параметров у героя", "Накладывает немоту на всех окружающих противников"], [], ["Даёт 80 ед. дополнительного урона, 50% крит урона и 15% шанса крита, но снижает эффективность лечения героя на 80%"], ["Герой уходит в мир духов, что позволяет не получать никакого физического урона. Под действием эффекта герой не может атаковать, но получает возможность проходить сквозь препятствия и увеличивает регенерацию здоровья на 25 ед."], ["Атаки героя снижают скорость передвижения и атаки цели на 50 ед., а также наносят 40 ед. магического урона", "Увеличивает урон героя на 30 ед. в ночное время суток"], ["Наносит периодический урон всем окружающим противникам"], [], [], ["Создаёт барьер вокруг героя, который поглощает до 300 ед. урона"], ["Увеличивает скорость передвижения на 20, а урон на 30 ед., если владелец получал урон в течении последних 3-х секунд"], [], ["Накладывает немоту на владельца и забирает 40 ед. здоровья в секунду. Взамен герой получает 20% шанса крита и 70% крит урона. Урон маски не может убить владельца", "Раз в 3 секунды увеличивает урон следующей атаки на 70%"], ["Накладывает оцепенение на героя и случайного противника поблизости. Применение наносит огромный урон противнику. Герой также получает урон в размере 33% урона способности. Урон способности не может убить героя"], ["Снижает броню цели атаки на 20%", "Атаки героя наносят на 20 ед. больше урона, если у цели менее 30% здоровья"], ["Увеличивает скорость передвижения на 100 ед., если владелец не получал урон в течении последних 5-ти секунд", "Увеличивает скорость атаки на 120 ед., но снижает урон заклинаний на 15% и увеличивает потребление маны для них на 50%", "Каждая атака наносит дополнительные 2% магического урона от максимального здоровья владельца"], ["Каждая атака с шансом 15% обезоружит противника", "Каждая атака восстанавливает владельцу 10 ед. здоровья"],
    ["Каждая атака с шансом 40% ударит противника молнией, наносящей урон и сжигающей 50 ед. маны", "Восстанавливает 90 ед. здоровья в секунду.<br>Здоровье восстанавливается вдвое медленнее, если в последние 2 секунды герой получал урон"], ["Даёт 100 ед. дополнительного урона, 70% крит урона и 25% шанса крита, но снижает эффективность лечения героя на 100%"], ["Снижает скорость передвижения на 40 ед., а скорость атаки на 60 ед. всех противников в небольшом радиусе вокруг героя. Противники в радиусе ауры получают периодический урон"], [], ["Снимает все негативные эффекты с владельца", "Каждая атака сжигает 20 ед. маны противника и наносит втрое больше чистого урона от сожённой маны. Также снижает эффективнось лечения цели на 40%"], ["С шансом 12% атака противника увеличит скорость атаки героя на 60 ед."], ["Увеличивает регенерацию здоровья на 5 ед., если здоровье ниже 30%"], ["С шансом 30% поглощает 90 ед. входящего урона", "Возвращает 25% входящего урона обратно в атакующего", "Время от времени увеличивает скорость атаки героя и союзников в радиусе 800 ед. на 60 ед."], ["Создаёт барьер вокруг героя, который поглощает до 300 ед. урона"], ["Раскрывает невидимых юнитов поблизости", "Уменьшает магическое сопротивление всех противников вокруг на 60% и накладывает на них немоту", "Любой урон от заклинаний и предметов владельца может быть критическим. Шанс и размер крита зависят от тех же параметров у героя"], ["Атаки героя снижают скорость передвижения и атаки цели на 50 ед., а также наносят 40 ед. магического урона. Снижает эффективнось лечения цели на 30%", "Увеличивает урон героя на 40 ед. в ночное время суток"], ["Снижает сопротивление эффектам на 20% всех противников вокруг героя", "Увеличивает скорость передвижения и урон на 35 ед., если владелец получал урон в течении последних 3-х секунд"], ["Герой уходит в мир духов, что позволяет не получать никакого физического урона. Под действием эффекта герой не может атаковать, но получает возможность проходить сквозь препятствия и увеличивает регенерацию здоровья на 25 ед.", "Наносит периодический урон всем окружающим противникам"], ["Поглощает любое направленное заклинание, целью которого стал герой"], ["Накладывает оцепенение и немоту на героя и случайного противника поблизости. Применение наносит огромный урон противнику. Герой также получает урон в размере 40% урона способности. Урон способности не может убить героя. На время действия оцепенения герой увеличивает свой шанс крита на 25%, а крит урон на 100%", "Раз в 3 секунды увеличивает урон следующей атаки на 100%"], ["Снижает броню цели атаки на 35%", "Атаки героя наносят на 20 ед. больше урона, если у цели менее 30% здоровья"], ["Увеличивает скорость передвижения на 100 ед., если владелец не получал урон в течении последних 5-ти секунд", "Увеличивает скорость атаки на 200 ед., но снижает урон заклинаний на 20% и увеличивает потребление маны для них на 70%", "Каждая атака наносит дополнительные 2% магического урона от максимального здоровья владельца"], ["Каждая атака с шансом 15% обезоружит противника", "Каждая атака восстанавливает владельцу 15 ед. здоровья"],
    [], [], [], ["Жертвуя 100 ед. здоровья герой увеличивает урон от заклинаний ещё на 25%"], [], ["Жертвуя 8% текущего здоровья герой восстанавливает в 1.5 раза больше маны"], [], ["Увеличивает входящий урон по герою на 15%. Возвращает 20% входящего урона обратно в атакующего"], [], ["Увеличивает весь входящий и исходящий урон на 100%. Под действием способности владелец не может погибнуть"], ["Снижает весь входящий урон на 15%"], ["Когда здоровье героя опускается ниже 15%, увеличивает регенерацию здоровья на 40 ед. в секунду, а также создаёт ауру вокруг героя, которая наносит периодический урон"], ["Увеличивает урон на 30 ед., если здоровье носителя выше 50%. В противном случае увеличивает входящий урон на 15%"], ["Повышает сопротивление магии владельца на 90%, а скорость восстановления маны на 50%"], ["Когда здоровье героя опускается ниже 15%, увеличивает регенерацию здоровья на 45 ед. в секунду, а также создаёт ауру вокруг героя, которая наносит периодический урон"], ["Каждая атака ненадолго оглушает цель и наносит огромный урон"], ["Применение способностей и предметов даёт один из следующих бонусов: повышает урон на 50 ед., повышает скорость атаки на 120 ед., повышает урон от заклинаний на 35%, повышает регенерацию здоровья на 35 ед., наносит 125 ед. чистого урона в радиусе 250 ед."], ["Когда здоровье героя опускается ниже 15%, увеличивает регенерацию здоровья на 50 ед. в секунду, а также создаёт ауру вокруг героя, которая наносит периодический урон"]
];
var item_damage = [ // Урон
    [], [], [], [], [], [], [], [6], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [10], [], [18], [], [], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [10], [40], [], [], [], [25], [], [], [], [], [], [0, 10], [], [],
    [], [], [], [], [80], [], [], [], [15], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [], [], [40], [25], [], [], [], [], [], [], [450], [0, 20], [], [],
    [140], [], [20], [], [], [], [], [], [], [], [40], [], [0, 30], [], [600, 0], [0, 20], [], [],
    [], [], [], [0], [], [0], [], [0], [], [0], [], [20], [], [0], [30], [60], [], [40]
];
var item_damage_type = [ // Тип урона (0 - чистый, 1 - магический, 2 - физический)
    [], [], [], [], [], [], [], [1], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [1], [], [1], [], [], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [1], [1], [], [], [], [1], [], [], [], [], [], [0, 0], [], [],
    [], [], [], [], [1], [], [], [], [1], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [], [], [1], [1], [], [], [], [], [], [], [2], [0, 0], [], [],
    [1], [], [1], [], [], [], [], [], [], [], [1], [], [0, 1], [], [2], [0, 0], [], [],
    [], [], [], [0], [], [0], [], [0], [], [0], [], [1], [], [0], [1], [2], [], [1]
]
var item_duration = [ // Длительность
    [], [], [], [], [], [], [], [2.5], [], [], [], [], [], [], [], [1], [], [],
    [], [6], [], [3], [0, 0], [1.2], [6], [], [], [], [], [2], [], [], [], [1], [], [],
    [], [], [], [], [], [1.5], [1.8], [], [4], [1.6], [], [6], [], [], [], [1.2, 0], [], [0.7],
    [8], [], [15], [4.5], [], [], [], [8], [], [8], [], [], [], [], [], [], [], [1],
    [0, 20], [], [0, 5], [], [8], [4], [1.4], [], [], [], [10], [], [], [8, 0], [3], [1.2, 0], [0, 6], [1.2],
    [0, 7], [8], [], [], [0, 2], [1.5], [], [0, 0, 2], [10], [0, 7], [1.5], [], [4], [], [4.5, 0], [1.5, 0], [0, 7.5], [1.2],
    [], [], [], [5], [], [0], [], [0], [], [10], [], [5], [], [4], [5], [0.3], [3], [5]
];
var item_range = [ // Дальность примнения (или радиус)
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [],
    [], [], [], [], [220], [], [], [], [], [], [], [], [], [], [], [], [], [],
    [], [500], [400], [350], [], [], [], [], [250], [], [], [], [400], [], [], [], [], [],
    [700, 600], [], [0, 300], [], [], [], [], [175], [], [], [], [], [], [], [300], [], [], [],
    [], [], [260], [], [], [], [], [], [], [800, 350], [], [400], [0, 180], [], [300, 0], [], [], [],
    [], [], [], [0], [], [0], [], [0], [], [0], [], [0], [], [0], [0], [0], [], [0]
];
var item_cd = [ // Перезарядка
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [18], [], [], [],
    [], [25], [], [], [0, 0], [], [12], [], [], [], [], [6.5], [], [], [], [], [], [],
    [], [], [], [], [], [], [4], [], [15], [], [], [12], [], [4], [], [], [], [],
    [40], [], [35], [17], [], [], [], [23], [], [14], [35], [], [], [3], [], [], [], [],
    [0, 40], [24], [0, 18], [], [15], [14], [], [], [], [], [18], [], [], [22, 3], [16], [], [0, 18], [],
    [0, 35], [14], [], [], [24], [3], [], [0, 0, 6], [18], [0, 25], [], [], [14, 0], [30], [15, 3], [], [0, 20], [],
    [], [], [], [13], [], [15], [], [0], [], [30], [], [120], [], [28], [95], [0], [], [70]
];
var item_mana = [ // Манакост
    [], [], [], [], [], [], [], [], [], [], [], [], [], [], [0], [], [], [],
    [], [5], [], [], [0, 0], [], [0], [], [], [], [], [0], [], [], [], [], [], [],
    [], [], [], [], [], [], [0], [], [25], [], [], [0], [], [0], [], [], [], [],
    [15], [], [60], [25], [], [], [], [0], [], [15], [0], [], [], [0], [], [], [], [],
    [0, 100], [120], [0, 45], [], [20], [20], [], [], [], [], [45], [], [], [0, 0], [55], [], [0, 60], [],
    [0, 10], [20], [], [], [120], [0], [], [0, 0, 0], [45], [0, 70], [], [], [20, 0], [0], [60, 0], [], [0, 85], [],
    [], [], [], [5], [], [0], [], [0], [], [10], [], [0], [], [30], [0], [0], [], [0]
];
var item_type = [ // Тип способности (0 - пассивная, 1 - активируемая, 2 - автоматическая, 3 - аура)
    [], [], [], [], [], [], [], [0], [], [], [0], [0], [], [], [1], [0], [], [],
    [], [1], [], [0], [0, 0], [0], [1], [0], [0], [], [], [2], [], [], [], [0], [], [],
    [], [], [], [], [3], [0], [2], [], [1], [0], [], [1], [], [2], [], [0, 0], [], [],
    [1], [0], [1], [1], [0], [], [], [1], [3], [1], [2], [], [3], [2], [], [], [], [],
    [0, 1], [1, 0], [0, 1], [], [1], [1], [0, 0], [3], [], [], [1], [], [], [1, 2], [1], [0, 0], [0, 1], [],
    [0, 1], [1], [3], [], [1, 0], [2], [], [0, 0, 2], [1], [0, 1], [0, 0], [3, 0], [1, 3], [2], [1, 2], [0, 0], [0, 1], [],
    [], [], [], [1], [], [1], [], [0], [], [1], [], [2], [], [1], [2], [0], [], [2]
];

var can_be_buying = [ // Можно ли купить или собрать предмет (0 - нет, 1 - да)
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
];

var gem_name = ["Рубин", "Сапфир", "Малахит", "Изумруд", "Янтарь", "Топаз", "Аметист", "Оникс", "Нефрит", "Алмаз"];
var gem_bonus_name = [["Здоровье", "Регенерация здоровья"], ["Мана", "Регенерация маны"], ["Урон"], ["Скорость атаки"], ["Уворот", "Скорость"], ["Крит урон", "Шанс крита"], ["Урон заклинаний"], ["Получаемый урон"], ["Наносимый урон"], ["Уровень прокачки предмета"]];
var gem_bonus = [[100, 1], [50, 0.5], [10], [15], [1, 5], [5, 1], [5], [-1], [1], [5]];
var gem_img = ["Ruby", "Sapphire", "Malachite", "Emerald", "Amber", "Topaz", "Amethyst", "Onyx", "Nephritis", "Diamond"];

function show_item_info_for_image(element) {
    show_item_info(document.getElementsByClassName("item")[element.id.slice(1)]);
}

function get_total_sum(item_id) {
    var sum = cost[item_id];
    for(var i = 0; i < components[item_id].length; i++) {
        sum+=get_total_sum(components[item_id][i]);
    }
    return sum;
}

function show_item_info(element = document.getElementsByClassName("item")[0]) {    //  Определять какой объект вызвал за счёт координат мыши
    document.getElementsByClassName("item")[select_item].style.borderColor = "rgba(255, 255, 255, 0)"; 
    select_item = element.getElementsByClassName("item_image")[0].id;
    refreshDataBySelectGeminItemlist(0, false);
    document.getElementsByClassName("item")[select_item].style.borderColor = "black"; 
    for(var i = 0; i < item_skill_name[select_item].length; i++) {
        document.getElementsByClassName("hero_skill")[i].style.visibility = "visible";
        /*document.getElementsByClassName("hero_skill")[i].style.backgroundImage = "url(unknow_skill.png);";*/
    }
    for(var i = item_skill_name[select_item].length; i < 3; i++) {
        document.getElementsByClassName("hero_skill")[i].style.visibility = "hidden";
    }
    document.querySelector("h1").innerHTML = "(" + select_item + ") " + item_name[select_item];
    if(get_total_sum(select_item) == cost[select_item]) {
        document.getElementById("gold_sum").innerHTML = cost[select_item];
        if(cost[select_item] == 0)
        document.getElementById("gold_sum").innerHTML = "Невозможно купить";
    }
    else{
        document.getElementById("gold_sum").innerHTML = cost[select_item] + "   (" + get_total_sum(select_item) + ")";
    }
    document.getElementById("item_icon_left_menu").style.backgroundImage = "url(items/" + item_eng_name[select_item] + ")";
    document.getElementById("item_icon_left_menu").style.borderColor = get_border_color(item_rarity[select_item]);
    document.getElementById("item_icon_left_menu").style.backgroundColor = get_border_color(item_rarity[select_item]);

        //  Удаление компонентов крафта
    elements_for_remove = document.getElementById("item_that_need").getElementsByClassName("item_icon");
    for(var i = 0; i < elements_for_remove.length;) {
        elements_for_remove[i].remove();
    }
        //  Удаление информации о крафтах, в которых использовался предмет
    elements_for_remove = document.getElementById("item_that_use").getElementsByClassName("item_icon");
    for(var i = 0; i < elements_for_remove.length;) {
        elements_for_remove[i].remove();
    }
        //  Добавление рецепта крафта
    for(var i = 0; i < components[select_item].length; i++) {
        let new_item = document.createElement("div");
        new_item.className = "item_icon";
        new_item.id = "k"+components[select_item][i];
        new_item.style.backgroundImage = "url(items/" + item_eng_name[components[select_item][i]] + ")";
        new_item.title = item_name[components[select_item][i]];
        new_item.style.borderColor = get_border_color(item_rarity[components[select_item][i]]);
        new_item.style.backgroundColor = get_border_color(item_rarity[components[select_item][i]]);
        new_item.addEventListener('click',
            function () {
                show_item_info_for_image(this);
            });
        document.getElementById("item_that_need").appendChild(new_item);
    }
        //  Добавление предметов, которые используют предмет
    var helper_bool = false;
    for(var i = 0; i < components.length; i++) {
        for(var j = 0; j < components[i].length; j++) {
            if(components[i][j] == select_item) {
                helper_bool = true;
                let new_item = document.createElement("div");
                new_item.className = "item_icon";
                new_item.id = "n"+i;
                new_item.style.backgroundImage = "url(items/" + item_eng_name[i] + ")";
                new_item.title = item_name[i];
                new_item.style.borderColor = get_border_color(item_rarity[i]);
                new_item.style.backgroundColor = get_border_color(item_rarity[i]);
                new_item.addEventListener('click',
                    function () {
                        show_item_info_for_image(this);
                    });
                document.getElementById("item_that_use").appendChild(new_item);
                break;
            }
        }
    }
    if(helper_bool) {
        elements_for_remove = document.getElementById("item_that_use_text").style.visibility = "visible";
    }
    else {
        elements_for_remove = document.getElementById("item_that_use_text").style.visibility = "hidden";
    }
        //  Отображения списка бонусов предмета
    elements_for_remove = document.getElementsByClassName("item_tr");
    for(var i = 0; i < elements_for_remove.length;) {
        elements_for_remove[i].remove();
    }
    for(var i = 0; i < item_bonus[select_item].length; i++) {
        create_stat_list(item_bonus[select_item][i], item_bonus_num[select_item][i])
    }
    document.getElementById("myRange").setAttribute("max", item_rarity[select_item] * 5 + 15);
    document.getElementById("myRange").value = 0;
    document.getElementById("slider_lvl").innerHTML = "lvl 0";
    createFullItemStatList();
}

function create_stat_list(name, stat) {
    let container = document.createElement("tr");
    container.className = "item_tr";
    let new_item_attribute = document.createElement("td");
    new_item_attribute.innerHTML = name + ":";
    new_item_attribute.className = "item_attribute_td";
    container.appendChild(new_item_attribute);

    let new_item_number = document.createElement("td");
    new_item_number.className = "item_number_td";

    edit_and_set_text_numbers(name, stat, new_item_number);

    container.appendChild(new_item_number);
    document.getElementById("hero_attribute").appendChild(container);
}

function edit_and_set_text_numbers(name, stat, item_number) {
    if(stat >= 0) {
        item_number.innerHTML = "+";
    }
    else {
        item_number.innerHTML = "";
    }

        item_number.innerHTML += Math.round((stat)*100)/100;

    if(name == "Защита" || name == "Сопротивление магии" ||name == "Сопротивление эффектам" ||
    name == "Уворот" || name == "Крит урон" || name == "Шанс крита" ||
    name == "Урон заклинаний" || name == "Вампиризм" ||  name == "Магический вампиризм" ||
    name == "Эффективность лечения" || name == "Манакост способностей" || name == "Перезарядка способностей"
    || name == "Эффективность восстановления маны" || name == "Урон по постройкам" || name == "Получаемый урон" || name == "Наносимый урон") {
        item_number.innerHTML += "%";
    }
}

function get_border_color(rarity) {
    switch(rarity) {
        case 1:
            return "rgba(25, 65, 245, 0.8)";
        case 2:
            return "rgba(25, 245, 80, 0.8)";
        case 3:
            return "rgba(193, 40, 255, 0.8)";
        case 4:
            return "rgba(255, 170, 15, 0.8)";
        case 5:
            return "rgba(255, 0, 0, 0.8)";
        default:
            return "rgba(110, 110, 110, 0.8)";
    }
}

var bonus_names = ["Здоровье", "Регенерация здоровья", "Мана", "Регенерация маны", "Урон", "Скорость атаки", "Защита", "Сопротивление магии", "Сопротивление эффектам", 
    "Скорость", "Дальность обзора (день)", "Дальность обзора (ночь)", "Уворот", "Крит урон", "Шанс крита", "Урон заклинаний", "Вампиризм", "Магический вампиризм",
    "Эффективность лечения", "Эффективность восстановления маны", "Манакост способностей", "Перезарядка способностей", "Урон по постройкам"];
var bonus_nums_per_coef = [16, 0.12, 10, 0.08, 0.6, 1.5, 0.4, 0.4, 0.8, 1, 10, 5, 0.2, 2, 0.3, 0.5, 0.4, 0.5, 0.5, 0.3, -0.3, -0.2, 0.3]

var item_bonus_additional = [ // Дополнительный параметр прокачки
    ["Здоровье", "Регенерация здоровья"], ["Мана", "Сопротивление магии"], ["Урон"], ["Шанс крита"], ["Защита"], ["Здоровье", "Защита"], ["Мана"], ["Урон"], ["Регенерация здоровья", "Урон"], ["Регенерация маны"], ["Защита"], ["Регенерация здоровья"], ["Сопротивление эффектам"], ["Крит урон"], ["Эффективность лечения"], ["Урон"], ["Регенерация маны", "Урон заклинаний"], ["Скорость атаки"],
    ["Здоровье", "Регенерация здоровья", "Сопротивление магии"], ["Регенерация здоровья", "Регенерация маны"], ["Урон", "Шанс крита"], ["Урон"], ["Защита"], ["Скорость атаки"], ["Регенерация здоровья", "Урон", "Вампиризм"], ["Вампиризм"], ["Здоровье", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], ["Здоровье", "Защита"], ["Регенерация маны", "Урон заклинаний"], ["Уворот"], ["Сопротивление магии", "Уворот"], ["Скорость атаки"], ["Скорость"], ["Мана", "Урон"], ["Здоровье", "Регенерация здоровья", "Защита"], ["Урон", "Скорость атаки"],
    ["Здоровье", "Регенерация здоровья", "Сопротивление магии"], ["Урон заклинаний", "Мана"], ["Здоровье", "Защита", "Скорость"], ["Мана", "Сопротивление магии"], ["Регенерация здоровья", "Регенерация маны", "Скорость атаки", "Урон заклинаний"], ["Скорость атаки"], ["Урон"], ["Крит урон"], ["Уворот"], ["Урон", "Скорость атаки", "Шанс крита"], ["Мана", "Регенерация маны"], ["Здоровье", "Регенерация здоровья", "Урон", "Вампиризм"], ["Здоровье", "Скорость"], ["Скорость атаки", "Скорость"], ["Скорость атаки", "Урон по постройкам"], ["Мана", "Урон", "Сопротивление магии"], ["Здоровье", "Регенерация здоровья", "Регенерация маны", "Защита", "Урон заклинаний"], ["Урон", "Скорость атаки"],
    ["Здоровье", "Регенерация здоровья", "Регенерация маны", "Эффективность лечения"], ["Дальность обзора (день)", "Дальность обзора (ночь)"], ["Урон заклинаний"], ["Урон заклинаний", "Мана"], ["Мана", "Регенерация маны", "Сопротивление магии"], ["Мана", "Сопротивление магии", "Уворот", "Шанс крита"], ["Урон", "Крит урон", "Шанс крита"], ["Здоровье", "Крит урон", "Вампиризм", "Магический вампиризм"], ["Здоровье", "Мана", "Регенерация маны", "Урон заклинаний"], ["Урон", "Вампиризм"], ["Мана", "Регенерация маны", "Сопротивление магии"], ["Регенерация здоровья", "Скорость"], ["Скорость"], ["Здоровье", "Защита", "Скорость атаки"], ["Регенерация здоровья", "Защита", "Сопротивление магии", "Эффективность лечения"], ["Урон", "Сопротивление магии", "Эффективность лечения", "Эффективность восстановления маны"], ["Скорость атаки", "Скорость", "Уворот", "Урон по постройкам"], ["Урон", "Скорость атаки", "Крит урон", "Шанс крита"],
    ["Урон заклинаний", "Дальность обзора (день)", "Дальность обзора (ночь)"], ["Мана", "Скорость атаки", "Шанс крита"], ["Крит урон", "Шанс крита", "Урон заклинаний"], ["Мана", "Защита", "Сопротивление магии", "Уворот", "Шанс крита"], ["Урон", "Вампиризм"], ["Здоровье", "Сопротивление магии", "Уворот"], ["Урон", "Скорость атаки", "Шанс крита"], ["Урон", "Крит урон", "Шанс крита"], ["Здоровье", "Регенерация здоровья"], ["Здоровье", "Защита", "Скорость"], ["Сопротивление эффектам", "Крит урон"], ["Здоровье", "Урон", "Скорость"], ["Регенерация здоровья", "Скорость атаки"], ["Здоровье", "Крит урон", "Вампиризм", "Магический вампиризм"], ["Здоровье", "Защита", "Сопротивление эффектам"], ["Мана", "Урон", "Сопротивление магии", "Эффективность лечения"], ["Здоровье", "Регенерация маны", "Защита", "Урон заклинаний"], ["Урон", "Скорость атаки", "Крит урон"],
    ["Регенерация маны", "Регенерация здоровья", "Сопротивление магии", "Эффективность восстановления маны"], ["Здоровье", "Урон", "Вампиризм"], ["Здоровье", "Мана", "Регенерация маны", "Сопротивление магии", "Урон заклинаний"], ["Здоровье", "Регенерация здоровья", "Урон", "Защита", "Скорость"], ["Регенерация здоровья", "Мана", "Скорость атаки", "Шанс крита"], ["Здоровье", "Урон", "Защита", "Скорость", "Крит урон"], ["Здоровье", "Регенерация здоровья", "Защита", "Сопротивление магии", "Эффективность лечения"], ["Регенерация здоровья", "Скорость", "Уворот", "Сопротивление эффектам"], ["Мана", "Защита", "Сопротивление магии", "Сопротивление эффектам", "Уворот", "Крит урон", "Шанс крита"], ["Крит урон", "Шанс крита", "Урон заклинаний", "Дальность обзора (день)", "Дальность обзора (ночь)"], ["Урон", "Скорость атаки", "Шанс крита", "Урон по постройкам"], ["Здоровье", "Регенерация здоровья", "Урон", "Скорость"], ["Здоровье", "Урон", "Сопротивление магии", "Уворот", "Крит урон", "Шанс крита"], ["Мана", "Регенерация маны", "Урон", "Сопротивление магии", "Сопротивление эффектам", "Эффективность восстановления маны"], ["Здоровье", "Регенерация маны", "Крит урон", "Урон заклинаний", "Вампиризм", "Магический вампиризм"], ["Мана", "Урон", "Сопротивление магии", "Вампиризм", "Эффективность лечения"], ["Здоровье", "Регенерация маны", "Защита", "Урон заклинаний"], ["Урон", "Скорость атаки", "Крит урон"],
    ["Регенерация маны", "Скорость атаки", "Скорость"], ["Мана"], ["Урон", "Магический вампиризм", "Манакост способностей", "Перезарядка способностей"], ["Регенерация маны", "Защита", "Сопротивление магии", "Урон заклинаний"], ["Регенерация здоровья", "Сопротивление эффектам"], ["Здоровье", "Регенерация здоровья"], ["Урон", "Скорость атаки", "Шанс крита"], ["Регенерация здоровья", "Защита", "Сопротивление магии", "Сопротивление эффектам"], ["Урон заклинаний", "Перезарядка способностей", "Магический вампиризм"], ["Урон", "Вампиризм"], ["Урон", "Крит урон", "Шанс крита", "Эффективность лечения"], ["Здоровье", "Эффективность лечения", "Эффективность восстановления маны"], ["Урон", "Скорость атаки", "Крит урон", "Шанс крита"], ["Регенерация здоровья", "Мана", "Сопротивление магии", "Сопротивление эффектам", "Уворот"], ["Здоровье", "Эффективность лечения", "Эффективность восстановления маны"], ["Урон", "Скорость атаки", "Крит урон"], ["Регенерация маны", "Сопротивление магии", "Урон заклинаний", "Манакост способностей"], ["Здоровье", "Эффективность лечения", "Эффективность восстановления маны"]
];
var item_bonus_num_additional = [ // Дополнительная сумма параметра при прокачке на 1 уровень
    [0.4, 0.6], [0.5, 0.5], [1], [1], [1], [0.5, 0.5], [1], [1], [-1.5, 2.5], [1], [1], [1], [1], [1], [1], [1], [2, -1], [1],
    [0.5, 0.7, 0.3], [1, 0.5], [1, 0.5], [1.5], [1.5], [1.5], [-1.5, 2.5, 0.5], [1.5], [-0.5, 1, 0.5, 0.5], [1, 0.5], [0.5, 1], [1.5], [-1, 2.5], [1.5], [1.5], [0.5, 1], [1.5, 1, -1], [0.5, 1],
    [0.5, 1, 0.5], [1.5, 0.5], [1, 2, -1], [0.5, 1.5], [0.3, 0.7, -0.5, 1.5], [2], [2], [2], [2], [0.5, 1, 0.5], [1, 1], [-0.5, -0.5, 1.5, 1.5], [0.5, 1.5], [1, 1], [1, 1], [0.5, 1, 0.5], [1, 1.5, 1.5, -1, -1], [1, 1],
    [0.5, 1, 0.5, 0.5], [1.3, 1.2], [2.5], [2, 0.5], [1, 1, 0.5], [0.5, 0.5, 1, 0.5], [1, 1, 0.5], [-0.5, 0.5, 1, 1], [0.5, 0.5, 1, 0.5], [1.5, 1], [2, -1.5, 2], [1.5, 1], [2.5], [1, 0.5, 1], [1, 0.5, 0.5, 0.5], [3, 0.5, -0.5, -0.5], [0.5, 1, 0.5, 0.5], [1, 1.5, 0.5, -0.5],
    [2, 0.6, 0.4], [-1.5, 3, 1], [0.5, 1, 1.5], [0.5, 0.5, 0.5, 1, 0.5], [2, 1], [1, 0.5, 1.5], [1, 1, 1], [1, 1, 1], [1, 2], [1.5, 2, -0.5], [1.5, 1.5], [0.5, 0.5, 2], [-1, 4], [0.5, 1, 0.5, 1], [1, 1, 1], [0.5, 2, 0.9, -0.4], [2, 0.5, 1, -0.5], [1, 1.5, 0.5],
    [1, 0.5, 1, 1], [-1, 3, 1.5], [0.5, 0.5, 1.5, 0.5, 0.5], [2, 2.5, -1.5, 1.5, -1], [-1, -1, 4, 1.5], [1, 2, 0.5, -1, 1], [0.5, 1.5, 0.5, 0.5, 0.5], [1.5, 0.5, 0.5, 1], [0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5], [0.5, 1, 1.5, 0.3, 0.2], [1, 1, 1, 0.5], [0.5, 0.5, 0.5, 2], [1, 1.5, -1, 1.5, 0.5, 1], [2.5, -1, 0.5, 1, 1.5, -1], [-0.5, 0.5, 1, 0.5, 1, 1], [0.65, 2, 0.5, 0.75, -0.4], [2, 1, 1, -0.5], [1, 2, 0.5],
    [-0.5, 1, 0.5], [1], [-0.5, 0.5, 0.5, 0.5], [0.6, 0.25, 0.25, 0.4], [1, 0.5], [0.75, 0.75], [0.5, 1, 0.5], [-0.5, 1, 1, 0.5], [2, -1, 1], [1.5, 1], [0.5, 0.5, 0.5, 1], [1.5, 0.5, 0.5], [0.5, 0.5, 1, 1], [0.5, 0.5, -1, 1.5, 1.5], [2, 0.5, 0.5], [3, -1, 1.5], [1, 0.5, 1, 1], [1.5, 1, 1]
];

function createFullItemStatList() {
    document.getElementById("slider_lvl").innerHTML = "lvl " + document.getElementById("myRange").value;

    // Удаление лишнего крафта
    elements_for_remove = document.getElementsByClassName("item_tr");
    element_names = document.getElementsByClassName("item_attribute_td");
    element_nums = document.getElementsByClassName("item_number_td");
    for(var i = item_bonus[select_item].length; i < elements_for_remove.length;)
        elements_for_remove[i].remove();
    // Установка данных по умолчанию (без улучшений)
    for(var i = 0; i < item_bonus[select_item].length; i++)
        edit_and_set_text_numbers(element_names[i].innerHTML.slice(0, -1), item_bonus_num[select_item][i], element_nums[i]);


    var additional_lvl = 0; // Дополнительный уровень предмета от самоцвета с бонусом "Уровень прокачки предмета"
    var selectedIndex = document.getElementsByClassName("hero_item_gem")[0].selectedIndex;
    if(selectedIndex != 0) {
        // Создание текста, которого не было изначально (для улучшений самоцветами)
        for(var i = 0; i < gem_bonus_name[(selectedIndex - 1) % 10].length; i++) {
            var flag = true;
            elements = document.getElementsByClassName("item_attribute_td");
            if(gem_bonus_name[(selectedIndex - 1) % 10][i] == "Уровень прокачки предмета") {
                if(selectedIndex > gem_bonus_name.length) 
                    additional_lvl = gem_bonus[(selectedIndex - 1) % 10][i] * 2;
                else
                    additional_lvl = gem_bonus[(selectedIndex - 1) % 10][i];
                document.getElementById("slider_lvl").innerHTML = "lvl " + document.getElementById("myRange").value + " +" + additional_lvl;
                continue;
            }
            for(var j = 0; j < elements.length; j++) {
                if(elements[j].innerHTML == gem_bonus_name[(selectedIndex - 1) % 10][i] + ":")
                    flag = false;
            }
            if(flag)
                create_stat_list(gem_bonus_name[(selectedIndex - 1) % 10][i], gem_bonus[(selectedIndex - 1) % 10][i])
        }
        was_added_flag = true;
    }


    var index_list = [];
    for(var i = 0; i < item_bonus_additional[select_item].length; i++) {
        var helper = 0;
        var index = bonus_names.find(function(element, index) {
            if(item_bonus_additional[select_item][i] == element)
                helper = index;
        });
        index_list.push(helper);
    }
    var was_added_flag = false;
    if(document.getElementById("myRange").value > 0 || additional_lvl > 0) {
        // Создание текста, которого не было изначально (для улучшений lvl)
        for(var i = 0; i < item_bonus_additional[select_item].length; i++) {
            var flag = true;
            elements = document.getElementsByClassName("item_attribute_td");
            for(var j = 0; j < elements.length; j++) {
                if(elements[j].innerHTML == item_bonus_additional[select_item][i] + ":")
                    flag = false;
            }
            if(flag)
                create_stat_list(item_bonus_additional[select_item][i], item_bonus_num_additional[select_item][i])
        }
        was_added_flag = true;
    }

    if(was_added_flag || selectedIndex != 0) {
        element_names = document.getElementsByClassName("item_attribute_td");
        element_nums = document.getElementsByClassName("item_number_td");

        var full_bonus_sum = [];
        for(var i = 0; i < element_names.length; i++) {
            if(i < item_bonus_num[select_item].length)
                full_bonus_sum.push(item_bonus_num[select_item][i]);
            else
                full_bonus_sum.push(0);
        }

        // Изменение параметров во всём тексте
        for(var i = 0; i < item_bonus_additional[select_item].length; i++) { // Получение бонуса к параметрам за уровень
            for(var j = 0; j < element_names.length; j++) {
                if(element_names[j].innerHTML.slice(0, -1) == item_bonus_additional[select_item][i]) {
                    full_bonus_sum[j] += item_bonus_num_additional[select_item][i] * bonus_nums_per_coef[index_list[i]] * (Number(document.getElementById("myRange").value) + additional_lvl);
                }
            }
        }
        if(selectedIndex != 0)
            for(var i = 0; i < gem_bonus_name[(selectedIndex - 1) % 10].length; i++) { // Получение бонуса к параметрам за самоцвет
                for(var j = 0; j < element_names.length; j++) {
                    if(element_names[j].innerHTML.slice(0, -1) == gem_bonus_name[(selectedIndex - 1) % 10][i]) {
                        if(gem_bonus_name[(selectedIndex - 1) % 10][i] == "Уровень прокачки предмета")
                            continue;
                        if(selectedIndex > gem_bonus_name.length)
                            full_bonus_sum[j] += gem_bonus[(selectedIndex - 1) % 10][i] * 2;
                        else
                            full_bonus_sum[j] += gem_bonus[(selectedIndex - 1) % 10][i];
                    }
                }
            }
        for(var i = 0; i < element_names.length; i++) { // Заполнение списка значениями
            edit_and_set_text_numbers(element_names[i].innerHTML.slice(0, -1), full_bonus_sum[i], element_nums[i]);
        }
    }
}

function createItemListMenu() {
    for(var i = 0; i < document.getElementsByClassName("hero_item_select").length; i++) {
        let new_empty_option = document.createElement("option");
        new_empty_option.innerHTML = "(Без предмета)";
        document.getElementsByClassName("hero_item_select")[i].appendChild(new_empty_option);
        for(var j = 0; j < item_name.length; j++) {
            let new_option = document.createElement("option");
            new_option.style.backgroundColor = get_border_color(item_rarity[j]);
            new_option.innerHTML = item_name[j];
            document.getElementsByClassName("hero_item_select")[i].appendChild(new_option);
        }
    }
}

function getSumOfStat(statName, baseStat, roundNumber = 0) { // Даёт сумму базовой характеристики (получаемое значение) и таких же у предметов
    var additionalStat = 0;
    var armor_helper_additional_stat = 0;
    if(statName == "Защита" || statName == "Сопротивление магии" || statName == "Сопротивление эффектам" || statName == "Уворот")
        armor_helper_additional_stat = 1 - baseStat / 100;
    for(var i = 0; i < 5; i++) { // Проход по всем предметам
        var additional_lvl_by_gem = 0;
        if(document.getElementsByClassName("hero_item_select")[i].selectedIndex != 0) {
            if(statName == "Защита" || statName == "Сопротивление магии" || statName == "Сопротивление эффектам" || statName == "Уворот")
                additionalStat = 0;
            var currentItemID = document.getElementsByClassName("hero_item_select")[i].selectedIndex - 1; // ID предмета (одного из 5-ти экипированных)
            for(var j = 0; j < item_bonus_additional[currentItemID].length; j++) { // Улучшения предмета
                if(item_bonus_additional[currentItemID][j] == statName) {
                    var helper = 0;
                    bonus_names.find(function(element, index) {
                        if(item_bonus_additional[currentItemID][j] == element)
                            helper = index;
                    });

                    if(Number(document.getElementsByClassName("hero_item_gem")[i].selectedIndex))
                        if(gem_bonus_name[(Number(document.getElementsByClassName("hero_item_gem")[i].selectedIndex) - 1) % gem_bonus_name.length][0] == "Уровень прокачки предмета")
                            additional_lvl_by_gem = gem_bonus[(Number(document.getElementsByClassName("hero_item_gem")[i].selectedIndex) - 1) % gem_bonus_name.length][0];
                            
                    if(Number(document.getElementsByClassName("hero_item_gem")[i].selectedIndex) > gem_bonus_name.length)
                        additional_lvl_by_gem *= 2;
                    additionalStat += item_bonus_num_additional[currentItemID][j] * (Number(document.getElementsByClassName("slider")[i].value) + additional_lvl_by_gem) * bonus_nums_per_coef[helper];
 
                }
            }
            for(var j = 0; j < item_bonus[currentItemID].length; j++) { // Базовые параметры предмета
                if(item_bonus[currentItemID][j] == statName)
                    additionalStat += item_bonus_num[currentItemID][j];
            }
            var gem_number = Number(document.getElementsByClassName("hero_item_gem")[i].selectedIndex) - 1; // Параметры самоцвета
            if(gem_number != -1) {
                var gem_quality = 1;
                if(gem_number >= gem_bonus_name.length) {
                    gem_quality *= 2;
                    gem_number -= gem_bonus_name.length;
                }
                for(var j = 0; j < gem_bonus_name[gem_number].length; j++) {
                    if(gem_bonus_name[gem_number][j] == statName)
                        additionalStat += gem_bonus[gem_number][j] * gem_quality;
                }
            }
            armor_helper_additional_stat *= (1 - additionalStat / 100);
        }
    }
    if(statName == "Защита" || statName == "Сопротивление магии" || statName == "Сопротивление эффектам" || statName == "Уворот")
        return (1 - armor_helper_additional_stat) * 100;
    return (baseStat + additionalStat).toFixed(roundNumber);
}

function refreshDataBySelectIteminItemlist(id) { // После выбора из выпадающего списка
    if(document.getElementsByClassName("hero_item_select")[id].selectedIndex == 0) {
        document.getElementsByClassName("slider")[id].disabled = true;
        document.getElementsByClassName("itemImage")[id].src = "items/unknow_item.png";
        document.getElementsByClassName("slider")[id].setAttribute("max", 0);
        document.getElementsByClassName("slider")[id].value = 0;
        document.getElementsByClassName("slider_lvl")[id].innerHTML = "lvl 0";
    }
    else{
        document.getElementsByClassName("slider")[id].disabled = false;
        document.getElementsByClassName("slider")[id].setAttribute("max", item_rarity[document.getElementsByClassName("hero_item_select")[id].selectedIndex-1] * 5 + 15);
        document.getElementsByClassName("itemImage")[id].src = "items/" + item_eng_name[document.getElementsByClassName("hero_item_select")[id].selectedIndex-1];
        if(document.getElementsByClassName("slider")[id].value > document.getElementsByClassName("slider")[id].getAttribute("max"))
            document.getElementsByClassName("slider")[id].value = document.getElementsByClassName("slider")[id].getAttribute("max");
    }
    refreshStatValuesBySelectItemLevel(id);
}

function createGemListMenu() {
    for(var i = 0; i < document.getElementsByClassName("hero_item_gem").length; i++) {
        let new_empty_option = document.createElement("option");
        new_empty_option.innerHTML = "(Без самоцвета)";
        document.getElementsByClassName("hero_item_gem")[i].appendChild(new_empty_option);
        for(var j = 0; j < gem_name.length; j++) {
            let new_option = document.createElement("option");
            new_option.style.backgroundColor = get_border_color(2);
            new_option.innerHTML = gem_name[j];
            document.getElementsByClassName("hero_item_gem")[i].appendChild(new_option);
        }
        for(var j = 0; j < gem_name.length; j++) {
            let new_option = document.createElement("option");
            new_option.style.backgroundColor = get_border_color(4);
            new_option.innerHTML = "Идеальный " + gem_name[j].toLowerCase();
            document.getElementsByClassName("hero_item_gem")[i].appendChild(new_option);
        }
    }
}
function refreshDataBySelectGeminItemlist(id, is_hero_stat_site = true) { // После выбора из выпадающего списка
    if(document.getElementsByClassName("hero_item_gem")[id].selectedIndex == 0) {
        document.getElementsByClassName("gemImage")[id].src = "items/unknow_item.png";
    }
    else{
        document.getElementsByClassName("gemImage")[id].src = "craft_gem_images/" + gem_img[(document.getElementsByClassName("hero_item_gem")[id].selectedIndex-1) % gem_img.length] + ".png";
    }
    if(is_hero_stat_site)
        refreshStatValuesBySelectItemLevel(id);
}