var skill_tree_name = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_about = [
    [
        "Увеличивает шанс крита на 3%",
        "Увеличивает скорость передвижения на 10 ед.", "Увеличивает шанс крита на 2%", "Увеличивает дальность атаки на 25 ед.",
        "Увеличивает крит урон на 7%", "Увеличивает скорость атаки на 5 ед.", "Увеличивает крит урон на 7%",
        "Увеличивает скорость передвижения на 20 ед.", "Увеличивает крит урон на 8%", "Увеличивает урон навыка \"Пронзание\" на 20 ед.",
        "Увеличивает крит урон на 20%", "Увеличивает скорость атаки на 15 ед.", "Увеличивает скорость передвижения на 40 ед.", "Увеличивает скорость атаки на 15 ед.", "Увеличивает скорость атаки на 20 ед.", "Увеличивает урон навыка \"Пронзание\" на 30 ед.", "Увеличивает длительность оглушения навыка \"Пронзание\" на 0.3 секунды",
        "Увеличивает шанс крита на 20%", "Увеличивает урон на 30 ед.", "Увеличивает дальность обзора днём и ночью на 200 ед.", "Увеличивает сопротивление эффектам на 40% (13.8 ед)", "Увеличивает шанс срабатывания навыка \"Пронзание\" на 4%", "Увеличивает длительность оглушения навыка \"Пронзание\" на 0.6 секунды",
        "Увеличивает урон на 50 ед.", "", "Увеличивает шанс срабатывания навыка \"Пронзание\" на 7%"
    ],
    [
        "Увеличивает скорость атаки на 5 ед.",
        "Увеличивает сопротивление эффектам на 5% (1.2 ед)", "Увеличивает урон на 3 ед.", "Увеличивает сопротивление эффектам на 5% (1.2 ед)",
        "Увеличивает шанс крита на 4%", "Увеличивает крит урон на 5%", "Увеличивает скорость передвижения на 15 ед.",
        "Увеличивает скорость атаки на 10 ед.", "Увеличивает регенерацию маны на 0.3 ед.", "Увеличивает урон способности \"Дыхание дракона\" на 5 ед.",
        "Увеличивает шанс крита на 10%", "Увеличивает урон на 15 ед.", "Увеличивает крит урон на 20%", "Увеличивает сопротивление эффектам на 15% (3.8 ед)", "Увеличивает регенерацию маны на 0.8 ед.", "Увеличивает радиус способности \"Дыхание дракона\" на 15 ед.", "Увеличивает скорость атаки на 20 ед.",
        "Увеличивает шанс крита на 20%", "Увеличивает урон на 30 ед.", "Увеличивает крит урон на 40%", "Увеличивает регенерацию маны на 1.6 ед.", "Увеличивает урон способности \"Дыхание дракона\" на 15 ед.", "Увеличивает скорость атаки на 40 ед.",
        "Увеличивает крит урон на 50%", "", "Увеличивает радиус способности \"Дыхание дракона\" на 50 ед."
    ],
    [
        "Увеличивает урон на 4 ед.",
        "Увеличивает регенерацию маны на 0.3 ед.", "Увеличивает шанс крита на 1%", "Увеличивает запас маны на 35 ед.",
        "Увеличивает шанс крита на 3%", "Увеличивает скорость передвижения на 10 ед.", "Увеличивает крит урон на 5%",
        "Увеличивает дальность атаки на 40 ед.", "Увеличивает регенерацию маны на 0.6 ед.", "Увеличивает дальность обзора днём и ночью на 70 ед.",
        "Увеличивает скорость передвижения на 50 ед.", "Увеличивает урон на 10 ед.", "Увеличивает шанс крита на 15%", "Увеличивает скорость передвижения на 35 ед.", "Уменьшает манакост способности \"Целебный свет\" на 3 ед.", "Увеличивает регенерацию маны на 0.9 ед.", "Уменьшает перезарядку способности \"Целебный свет\" на 1.5 секунд",
        "Увеличивает скорость атаки на 30 ед.", "Увеличивает урон на 20 ед.", "Увеличивает шанс крита на 30%", "Уменьшает манакост способности \"Целебный свет\" на 6 ед.", "Увеличивает лечение способности \"Целебный свет\" на 20 ед.", "Уменьшает перезарядку способности \"Целебный свет\" на 3 секунды",
        "Увеличивает крит урон на 35%", "", "Увеличивает лечение способности \"Целебный свет\" на 35 ед."
    ],
    [
        "Увеличивает крит урон на 5%",
        "Увеличивает урон на 4 ед.", "Увеличивает скорость передвижения на 10 ед.", "Увеличивает скорость передвижения на 15 ед.",
        "Увеличивает шанс крита на 4%", "Увеличивает крит урон на 5%", "Увеличивает шанс крита на 4%",
        "Увеличивает скорость передвижения на 30 ед.", "Увеличивает шанс крита на 4%", "Увеличивает дальность обзора днём и ночью на 50 ед.",
        "Увеличивает скорость атаки на 15 ед.", "Увеличивает шанс крита на 8%", "Увеличивает скорость атаки на 15 ед.", "Увеличивает крит урон на 15%", "Увеличивает урон навыка \"Водоворот\" на 15 ед.", "Увеличивает дальность обзора днём и ночью на 75 ед.", "Увеличивает длительность оцепенения навыка \"Водоворот\" на 0.4 секунды",
        "Увеличивает сопротивление эффектам на 30% (8.9 ед)", "Увеличивает урон на 20 ед.", "Увеличивает сопротивление эффектам на 30% (8.9 ед)", "Увеличивает урон навыка \"Водоворот\" на 30 ед.", "Увеличивает шанс срабатывания навыка \"Водоворот\" на 6%", "Увеличивает длительность оцепенения навыка \"Водоворот\" на 0.8 секунды",
        "Увеличивает урон на 35 ед.", "", "Увеличивает шанс срабатывания навыка \"Водоворот\" на 10%"
    ],
    [
        "Увеличивает скорость передвижения на 10 ед.",
        "Увеличивает регенерацию маны на 0.2 ед.", "Увеличивает урон на 3 ед.", "Увеличивает сопротивление эффектам на 5% (1.2 ед)",
        "Увеличивает урон на 7 ед.", "Увеличивает шанс крита на 3%", "Увеличивает дальность атаки на 40 ед.",
        "Увеличивает урон на 10 ед.", "Увеличивает регенерацию маны на 0.3 ед.", "Увеличивает урон способности \"Рывок\" на 30 ед.",
        "Увеличивает скорость атаки на 20 ед.", "Увеличивает урон на 15 ед.", "Увеличивает крит урон на 20%", "Увеличивает сопротивление эффектам на 15% (3.8 ед)", "Уменьшает манакост способности \"Рывок\" на 4 ед.", "Увеличивает урон способности \"Рывок\" на 45 ед.", "Уменьшает перезарядку способности \"Рывок\" на 2 секунды",
        "Увеличивает скорость атаки на 40 ед.", "Увеличивает скорость передвижения на 60 ед.", "Увеличивает крит урон на 40%", "Уменьшает манакост способности \"Рывок\" на 8 ед.", "Уменьшает время оглушения после применения навыка \"Рывок\" на 0.6 секунд", "Уменьшает перезарядку способности \"Рывок\" на 4 секунды",
        "Увеличивает шанс крита на 25%", "", "Уменьшает время оглушения после применения навыка \"Рывок\" на 1 секунду"
    ]
];

var skill_tree_bonus = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_bonus_about = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_image = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

/*var skill_tree_cost = [ //  Стоимость прокачки ветки навыков компаньона  
    150,
    750, 450, 750,
    1200, 750, 1200,
    1500, 1200, 1500,
    3000, 2200, 3000, 2500, 3000, 2200, 3000,
    6000, 4500, 6000, 6000, 4500, 6000,
    7500, 6000, 7500
];*/

var skill_tree_cost = [ //  Стоимость прокачки ветки навыков компаньона  
    50,
    250, 150, 250,
    350, 200, 350,
    400, 300, 400,
    800, 500, 800, 600, 800, 500, 800,
    1700, 1200, 1700, 1700, 1200, 1700,
    2000, 1500, 2000
];