var skill_tree_name = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_about = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "Увеличивает урон компаньона на 2 ед.",
        "Увеличивает регенерацию маны компаньона на 0.2 ед.", "Увеличивает скорость передвижения компаньона на 10 ед.", "Увеличивает запас маны компаньона на 15 ед.",
        "Увеличивает урон компаньона на 7 ед.", "Увеличивает шанс крита компаньона на 3%", "Увеличивает дальность атаки компаньона на 50 ед.",
        "Увеличивает урон компаньона на 10 ед.", "Увеличивает запас маны компаньона на 20 ед.", "Увеличивает урон способности \"Рывок\" на 30 ед.",
        "Увеличивает скорость атаки компаньона на 15 ед.", "Увеличивает урон компаньона на 15 ед.", "Увеличивает крит урон компаньона на 15%", "Увеличивает регенерацию маны компаньона на 0.5 ед.", "Увеличивает регенерацию маны компаньона на 0.4 ед.", "Увеличивает урон способности \"Рывок\" на 45 ед.", "Уменьшает перезарядку способности \"Рывок\" на 1.5 секунд",
        "Увеличивает скорость атаки компаньона на 30 ед.", "Увеличивает скорость передвижения компаньона на 30 ед.", "Увеличивает крит урон компаньона на 30%", "Увеличивает регенерацию маны компаньона на 0.8 ед.", "Уменьшает время оглушения после применения навыка \"Рывок\" на 0.5 секунд", "Уменьшает перезарядку способности \"Рывок\" на 3 секунды",
        "Увеличивает шанс крита компаньона на 10%", "", "Уменьшает время оглушения после применения навыка \"Рывок\" на 1 секунду"
    ]
];

var skill_tree_bonus = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_bonus_about = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_image = [
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ],
    [
        "",
        "", "", "",
        "", "", "",
        "", "", "",
        "", "", "", "", "", "", "",
        "", "", "", "", "", "",
        "", "", ""
    ]
];

var skill_tree_cost = [ //  Стоимость прокачки ветки навыков компаньона  
    100,
    500, 300, 500,
    750, 500, 750,
    1000, 800, 1000,
    2000, 1500, 2000, 1500, 2000, 1500, 2000,
    4000, 3000, 4000, 4000, 3000, 4000,
    5000, 4000, 5000
];